Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/personal_insolvency_options.html.txt.tmx
Source language: en
Languages: ga

source: Before contacting the MABS Helpline for this eligibility check, you will need to assemble all the relevant information about your debts, assets, income and circumstances
ga: Sula ndéanann tú teagmháil le líne chabhrach MABS le haghaidh na seirbhíse seiceála seo, caithfidh tú an fhaisnéis ábhartha ar fad faoi d’fhiacha, do shócmhainní, d’ioncam agus do thosca a chur le chéile

source: The MABS Helpline is at 0761 07 2000, Monday to Friday from 9 am to 8 pm
ga: Líne chabhrach MABS: 0761 07 2000, Luan go hAoine, 9 rn go 8 in

source: Read more on the MABS website
ga: Tá tuilleadh eolais ar láithreán MABS

source: For a Debt Settlement Arrangement or a Personal Insolvency Arrangement, you must apply through a Personal Insolvency Practitioner (PIP)
ga: I gcás Socrú Réitigh Fiachais nó Socrú um Dhócmhainneacht Phearsanta, ní mór duit iarratas a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP)

source: You can choose a PIP from the Register that is published by the ISI
ga: Is féidir PIP a roghnú ón gClár atá foilsithe ag an SDÉ

source: Further information is available from the ISI’s helpline 0761 06 4200 (Monday to Friday, 9 am to 6 pm) and from its main website isi.gov.ie, as well as its website backontrack.ie for people who are struggling with debt
ga: Ta fáil ar bhreis faisnéise ó líne chabhrach an SDÉ, 0761 06 4200 (Luan go hAoine, 9 rn go 6 in) agus ar a láithreán gréasáin, isi.gov.ie
